supportedInstructions=Podr\u017Eane instrukcije
mnemonic=Mnemonik
instruction=Instrukcija
meaning=Zna\u010Denje
binaryCode=Binarni kod
console=Konzola
code=Kod
control=Kontrola
memory=Memorija
datapath=Put podataka
register=Registar
value=Vrijednost
clock=Ciklus
subClock=Podciklus
address=Adresa
searchByAddress=Pretra\u017Ei memoriju po adresi
controlMemory=Kontrolna memorija
file=Datoteka
new=Nova
load=U\u010Ditaj
save=Spasi
examples=Primjeri
simpleAdder=Jednostavni Sabira\u010D
nthFibNum=N-ti Fibno\u010Dijev broj
exit=Izlaz
execute=Izvr\u0161i
run=Pokreni F1
nextSubClk=Sljede\u0107i podciklus F2
nextClk=Sljede\u0107i ciklus F3
help=Pomo\u0107
about=O aplikaciji
newFile=Nova datoteka Ctrl+N
loadFile=U\u010Ditaj datoteku Ctrl+L
saveFile=Spasi datoteku Ctrl+S
runCode=Pokreni kod F1
language=Jezik:
successful-assemble=Uspje\u0161no asembliran kod
line-num-err-message=Gre\u0161ka na liniji 
unknown-instr-mnemonic=, nepoznat instrukcijski mnemonik
missing-arg=, nedostaje argument
unknown-label=, neprepoznata labela
arg-out-of-bounds=, argument izvan dozvoljenih granica
invalid-arg=, nevalidan argument
too-many-args=, previ\u0161e argumenata
no-code-err=Gre\u0161ka polje za unos koda je prazno
recurring-label=, labela se ponavlja
error=Gre\u0161ka
invalid-new-val=Nevalidna nova vrijednost!
valid-range=dozvoljeni opseg vrijednosti je
immutable-reg=registar je neizmjenjiv
confirmation=Potvrda
new-code-file=Da li ste sigurni da \u017Eelite kreirati novu kodnu datoteku
curr-progress=Trenutni progres \u0107e biti izgubljen
instr-fetch=Instrukcija se dobavlja...
instr-exec=Izvr\u0161ava se instrukcija
decimal=Decimalni
binary=Binarni
LODD=Napuni direktno
STOD=Smjesti direktno
ADDD=Dodaj direktno
SUBD=Oduzmi direktno
JPOS=Sko\u010Di ako je (ac)>=0
JZER=Sko\u010Di ako je (ac)==0
JUMP=Bezuslovan skok
LOCO=Napuni konstant
LODL=Napuni lokalno
STOL=Smjesti lokalno
ADDL=Saberi lokalno
SUBL=Oduzmi lokalno
JNEG=Sko\u010Di ako je (ac)<0
JNZE=Sko\u010Di ako je (ac)!=0
CALL=Poziv procedure
PSHI=Smjesti na stek indirektno
POPI=Pokupi sa steka indirektno
PUSH=Smjesti na stek
POP=Pokupi sa steka
RETN=Povratak iz procedure
SWAP=Zamijeni sadr\u017Eaj ac i sp
INSP=Inkrementiraj sp
DESP=Dekrementiraj sp
credits=Zahvale
icons-download=Sve ikone su preuzete sa
icon-authors=Autori ikona su navedeni ispod:
run-button=- dugme pokreni, dugme sljede\u0107i podciklus, dugme sljede\u0107i ciklus:
load-file-button=- dugme u\u010Ditaj datoteku:
new-file-button=- dugme nova datoteka:
save-button=- dugme spasi:
language-circles=- ikone za odabir jezika
back=Nazad
jumpToEnd=Sko\u010Di na kraj
endProgram=Prekini izvr\u0161avanje F4
program-exec-stop=Izvr\u0161enje programa prekinuto
load-code-file=Da li ste sigurni da \u017Eelite u\u010Ditati novu kodnu datoteku
load-code-example=Da li ste sigurni da \u017Eelite u\u010Ditati novi primjer
end-program-exec-warn=Da li ste sigurni da \u017Eelite prekinuti trenutno izvr\u0161enje programa
firstNToStack=Prvih n brojeva na stek
app-description=MIC-1 Simulator je interaktivni simulator oglednog procesora MIC-1, opisanog u ud\u017Ebeniku "Structured Computer Organization", autora Andrew S. Tanenbaum. Aplikacija je prvenstveno namjenjena studentima elektrotehni\u010Dkog fakulteta u Sarajevu, ali naravno svako je dobrodo\u0161ao da istu koristi. Ideja jeste da korisnik kroz kori\u0161tenje aplikacije stekne bolji uvid u rad oglednog procesora MIC-1. Korisniku je omogu\u0107eno da napi\u0161e kod koriste\u0107i set dosupnih instrukcija, zatim da isti pokrene i izvr\u0161ava kroz cikluse procesora. Tokom izvr\u0161avanja instrukcija korisnik mo\u017Ee da prati stanje memorije, kontrolne memorije, procesorskih registara, kao i pojedina\u010Dnih komponenti samog procesora.
how-to=Upute
app-use=O kori\u0161tenju aplikacije
useful-tips=Korisni savjeti
get-involved=Uklju\u010Dite se
key-shortcuts=Kratice
report-bugs=Prijavite bug-ove
help-development=Pomognite u razvoju
icons=Ikone
icon-credits=Sve ikone su preuzete sa\n - https://www.flaticon.com/\n\nLista autora je kako slijedi\n\nIkona pokreni, Ikona sljede\u0107i podciklus, Ikona sljede\u0107i ciklus, Gmail ikona\n - https://www.flaticon.com/authors/pixel-perfect\n\nIkona u\u010Ditaj datoteku\n - https://www.flaticon.com/authors/iconixar\n\nIkona nova datoteka\n - https://www.flaticon.com/authors/smashicons\n\nIkona zavr\u0161i program\n - https://www.flaticon.com/authors/alfredo-hernandez\n\nIkone zastave, Ikona spasi datoteku, Facebook ikona, GitHub ikona\n - https://www.flaticon.com/authors/freepik\n\nIkona aplikacije\n - https://www.flaticon.com/authors/chattapat\n\nLinked in ikona\n - https://www.flaticon.com/authors/riajulislam
report-bugs-text=Budite otvoreni da prijavite bug-ove. Da biste prijavili bug mo\u017Eete:\n - Otvoriti issue na GitHub-u na linku https://github.com/abecirovic3/MIC-1-Simulator/issues\n - Prijaviti bug na mail abecirovic3@etf.unsa.ba
help-development-text=\u017Delite sudjelovati u razvoju aplikacije?\n\nDa biste dali svoj doprinos pratite sljede\u0107e korake:\n - Kreirajte fork projekta\n - Uradite clone fork-anog projekta na va\u0161e lokalno okru\u017Eenje\n - Kreirajte novi branch\n - Dodajte va\u0161e izmjene\n - Uradite push izmjena na va\u0161 repozitorij\n - Na va\u0161em GitHub repozitoriju kliknite na dugme 'Compare & pull request'\n - Ostavite komentar i kreirajte pull request\n\nNapomena, imenovanje branch-eva bi trebalo biti feature-[naziv] za nove funkcionalnosti, fix-[naziv] za popravljanje bug-ova
shortcuts-text=Iskoristite tastaturu i ponu\u0111ene kratice.\nDa biste pokrenuli kod prtisnite F1\nDa biste izvr\u0161ili podciklus pritisnite F2\nDa biste izvr\u0161ili ciklus pritisnite F3\nDa biste prekinuli izvr\u0161enje programa pritisnite F4\nDa biste kreirali novu datoteku pritisnite Ctrl+N\nDa biste u\u010Ditali datoteku pritisnite Ctrl+L\nDa biste spasili datoteku pritisnite Ctrl+S\nDa biste mijenjali tabove pritisnite Ctrl+TAB
close=Zatvori
contact=Kontakt
contact-me=Kontaktirajte me
use-app-text=Glavni cilj aplikacije jeste da omogu\u0107i korisniku izvr\u0161avanje procesorskih instrukcija kroz cikluse.\n\nAplikacije je podijeljenja u \u010Detiri taba: kod, kontrola, memorija i put podataka. Sada \u0107emo dati obja\u0161njenje za pojedina\u010Dne tabove.\n\nKod tab\nU kod tabu mo\u017Eete vidjeti tabelu koja sadr\u017Ei informacije o instrukcijskom setu procesora. Mo\u017Eete se poslu\u017Eiti ovom tabelom prilikom pisanja koda (Komentari su isklju\u010Divo jednolinijski i zapo\u010Dinju sa karakterom ;). Lijevo od ove tabele nalazi se prostor za pisanje koda. Ispod tabele nalazi se konzolno polje koje prikazuje poruke o ospje\u0161nom ili neuspje\u0161nom asembliranju koda. Kao \u0161to je ranije spomenuto mo\u017Eete pisati valstiti kod, a mo\u017Eete tako\u0111e iskoristiti i primjere dostupne unutar aplikacije. Ako \u017Eelite da u\u010Ditate primjer, odaberiti meni Datoteka, odaberite Primjeri i zatim odaberiti \u017Eeljeni primjer. Tako\u0111e da biste u\u010Ditali kod mo\u017Eete u\u010Ditati datoteku, koja sadr\u017Ei validan kod, sa va\u0161eg sistema. Da biste u\u010Ditali datoteku mo\u017Eete pritisnuti Ctr+L, ili mo\u017Eete ponovo odabrati meni Datoteka i odabrati opciju U\u010Ditaj. Obratite pa\u017Enju da dopu\u0161teni tipovi datoteka su .txt i .mic1. Pri \u010Demi je .mic1 samo ekstenzija koju mo\u017Eete dodjeljivati va\u0161im datotekama radi razlikovanja od drugih tekstualnih datoteka. Nakon \u0161to na neki od na\u010Dina u\u010Ditate kod, mo\u017Eete isti i pokrenuti pritiskom tipke F1, klikom na dugme za zelenim trokutom, ili odabirom Pokreni opcije iz Izvr\u0161i menija. Ako je kod valjan bi\u0107e uspje\u0161no asembliran i u konzoli \u0107ete vidjeti poruko o uspjehu, u suprotnom ako kod sadr\u017Ei gre\u0161ke, dobi\u0107ete odgovoraju\u0107u poruku. Popravite gre\u0161ku i pokrenite kod ponovo. Da biste izvr\u0161avali instrukcije mo\u017Eete odabrati opciju da ivr\u0161ite jedan podciklus ili jedan ciklus. Da biste izvr\u0161ili jedan podciklus pritisnite F2, kliknite na dugme sa jednostrukom strelicom u desno, ili odaberite opciju Sljede\u0107i podciklus iz Izvr\u0161i menija. Da biste izvr\u0161ili jedan ciklus pritisnite F3, kliknite na dugme sa dvostrukom strelicom u desno, ili odaberite opciju Sljede\u0107i ciklus iz Izvr\u0161i menija. Da biste prekinuli izvr\u0161enje programa i vratili se na po\u010Detno stanje pritisnite F4, kliknite na dugme sa crvenim kvadratom, ili odaberite opciju Prekini izvr\u0161avanje iz Izvr\u0161i menija. Da biste spasili va\u0161 kod pritisnite Ctrl+S, kliknite na dugme sa disketom, ili odaberite opciju Spasi iz Datoteka menija. U ovoj sekciji smo pro\u0161li kroz to kako pisati ili u\u010Ditati kod, kako pokrenuti i izvr\u0161avati, i kako spasiti isti.\n\nKontrola tab\nKontrolni tab predstavlja kontrolnu jedinicu procesora. U ovom tabu vidimo polje sa ljudima-razumljivim kodom koji predstavlja mikrokod. Desno od ovog polja imamo tabelu koja predstavlja kontrolnu memoriju koja sadr\u017Ei mikroinstrukcije u binarnom formatu. U toku izvr\u0161avanja programa, u kontrolnom tabu, zelenom bojom \u0107e biti nagla\u0161ena trenutno aktivna mikroinstrukcija.\n\nMemorija tab\nMemorija tab predstavlja glavnu memoriju. U ovom tabu mo\u017Eemo vidjeti polje za pretragu i jednu tabelu. Tabela predstavlja 4096 dostupnijh memorijskih lokacija, i s obzirom da je velika tabela ponudili smo polje za pretragu iste. Da biste pretra\u017Eili tabelu ukucajte validnu adresu u rasponu 0 do 4095 i kliknite na dugme pretrage. Vrijednost date adrese \u0107e biti u\u010Ditana u polje desno od dugmeta, i tabela \u0107e biti skrolovana do tra\u017Eene adrese pri \u010Demu \u0107e odgovaraju\u0107i red biti ozna\u010Den. Tako\u0111e mo\u017Eete dvokliknutu na bilo koju \u0107eliju u koloni Vrijednost kako biste postavili \u017Eeljenu vrijednost na datoj memorijskoj adresi. Vodite ra\u010Duna da ukucana vrijednost mora biti 16-bitni cijeli broj. Tako\u0111e obratite pa\u017Enju da \u0107e asemblirani kod biti spa\u0161en u memoriju po\u010Dev\u0161i od lokacije 0. Pa tako ako va\u0161 kod ima 3 instrukcije, adrese 0, 1 i 2 \u0107e sadr\u017Eavati te instrukcije. To zna\u010Di da mijenjanje vrijednosti na ovim lokacijama \u0107e rezultovati nepredvidivim pona\u0161anjem.\n\nPut podataka tab\nMo\u017Eemo re\u0107i da tab Put podataka je glavni tab aplikacije. Glavna ideja ovog taba jeste da omogu\u0107i korisniku da prati stanje registara procesora, stanje MBR, MAR, MIR i MPC registara, stanje trenutno izvr\u0161avanog podciklusa i ciklusa, i tako\u0111e da omogu\u0107i korisniku pra\u0107enje protoka podataka. Da biste pratili put podataka postavite svoj mi\u0161 iznad komponente koju \u017Eelite da provjerite, i dobi\u0107ete prikaz stanja te komponente. Obratite pa\u017Enju da korektne vrijednosti stanja komponente su vidljive tek nakon \u0161to je komponenta bila aktivna. Razli\u010Dite komponente su aktivne u razli\u010Ditim podciklusima. Ako je komponenta bila aktivna u nekom podciklusu ona \u0107e biti obojena. Npr. ALU \u0107e biti obojen u zeleno nakon tre\u0107eg podciklusa, \u0161to sugeri\u0161e da je ALU bio aktivan u datom podciklusu. Obratite pa\u017Enju da ovakav prikaz puta podataka nije sasvim u skladu sa stvarnom implementacijom procesora, s obzirom na impulse sata i sl., ali daje uvid u protok podataka kroz komponente. Tabela procesorskih registara je tako\u0111e izmjenjiva. Dvokliknite na neku od \u0107elija u koloni Vrijednost i postavite \u017Eeljenu vrijednost. Vodite ra\u010Duna da su neki registri neizmjenjivi i da morate unijeti korektnu vrijednost (korektne vrijednosti zavise od pojedina\u010Dnih registara). Jedna interesantna funkcionalnost dostupna u ovom tabu jeste i instrukcijsko-statusna traka koja se nalazi na dnu i prikazuje da li se instrukcija dobavlja, a ako je dobavljena koja se instrukcija izvr\u0161ava trenutno. Ovo je bio kratki pregled taba Put podataka, sami dalje ekspirimenti\u0161ite i pronalazite druge korisne funkcionalnosti.\n\nOvo su bili tabovi aplikacije. Jo\u0161 jedna funkcionalnost je promjena brojnog sistema u kojem su vrijednosti, prisutne u tabu Memorija i Put podataka, predstavljene. U gornjem desnom dijelu prozora se nalazi select komponenta. Odaberite \u017Eeljeni brojni sistem i odmah \u0107ete vidjeti promjenu u prikazu vrijednosti.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n